InformationRegisters/гф_ДанныеВыгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ДанныеВыгрузки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>гф_ОшибкиЗагрузки</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьФайла</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/гф_ДанныеВыгрузки/Ext/RecordSetModule.bsl
&Вместо("ПередЗаписью")
Процедура гф_ПередЗаписью(Отказ, Замещение)
	// #wortmann { 
	// Проверка на заполненность измерения "Документ" при виде данных "Документ" 
	// Галфинд_Домнышева 2023/07/26
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		Если ТекЗапись.ВидДанных = Перечисления.гф_ВидыДанныхДляВыгрузки.Документ 
			И НЕ ЗначениеЗаполнено(ТекЗапись.Документ) Тогда
			Попытка	
				МенеджерЗаписи = РегистрыСведений.гф_ОшибкиЗагрузки.СоздатьМенеджерЗаписи(); 				
				МенеджерЗаписи.Дата = ТекущаяДатаСеанса();
				МенеджерЗаписи.ПутьФайла = ТекЗапись.ИмяФайла; 
				МенеджерЗаписи.Номер =  "000";
				МенеджерЗаписи.ТекстОшибки = "Не выполнена запись в РС ""ДанныеВыгрузки"", не заполнено значение ""Документ""";
				МенеджерЗаписи.Интерфейс = Перечисления.гф_Интерфейсы.WMS;
				МенеджерЗаписи.ТипИнформации = "Ошибка";
				МенеджерЗаписи.Записать(); 
				
			Исключение
				СообщениеОбОшибке = "Ошибка при записи файла " + ТекЗапись.ИмяФайла  
				+ ". Описание ошибки: Не удалось загрузить ТекстОшибки в РС гф_ОшибкиЗагрузки. " + ОписаниеОшибки();
				ЗаписьЖурналаРегистрации("РСДанныеВыгрузки", УровеньЖурналаРегистрации.Ошибка, ЭтотОбъект, ЭтотОбъект, СообщениеОбОшибке);		
			КонецПопытки;
			Отказ = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	// } #wortmann
	ПродолжитьВызов(Отказ, Замещение);
КонецПроцедуры
